Script started on Mon 13 Apr 2015 10:57:21 PM PDT
]0;bxiao@pc20:~[bxiao@pc20 ~]$ gdb a.out
[?1034hGNU gdb (GDB) Fedora 7.7.1-21.fc20
Copyright (C) 2014 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "i686-redhat-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) h
List of classes of commands:

aliases -- Aliases of other commands
breakpoints -- Making program stop at certain points
data -- Examining data
files -- Specifying and examining files
internals -- Maintenance commands
obscure -- Obscure features
running -- Running the program
stack -- Examining the stack
status -- Status inquiries
support -- Support facilities
tracepoints -- Tracing of program execution without stopping the program
user-defined -- User-defined commands

Type "help" followed by a class name for a list of commands in that class.
Type "help all" for the list of all commands.
Type "help" followed by command name for full documentation.
Type "apropos word" to search for commands related to "word".
Command name abbreviations are allowed if unambiguous.
(gdb) r
Starting program: /home/bxiao/a.out 
Enter upper bound:
bt
[Inferior 1 (process 22244) exited normally]
Missing separate debuginfos, use: debuginfo-install glibc-2.18-19.fc20.i686
(gdb) k
The program is not being run.
(gdb) h
List of classes of commands:

aliases -- Aliases of other commands
breakpoints -- Making program stop at certain points
data -- Examining data
files -- Specifying and examining files
internals -- Maintenance commands
obscure -- Obscure features
running -- Running the program
stack -- Examining the stack
status -- Status inquiries
support -- Support facilities
tracepoints -- Tracing of program execution without stopping the program
user-defined -- User-defined commands

Type "help" followed by a class name for a list of commands in that class.
Type "help all" for the list of all commands.
Type "help" followed by command name for full documentation.
Type "apropos word" to search for commands related to "word".
Command name abbreviations are allowed if unambiguous.
(gdb) r
Starting program: /home/bxiao/a.out 
Enter upper bound:
20

Program received signal SIGSEGV, Segmentation fault.
0x479aaabe in __GI__IO_vfscanf () from /lib/libc.so.6
(gdb) bt
#0  0x479aaabe in __GI__IO_vfscanf () from /lib/libc.so.6
#1  0x479b94a6 in __isoc99_scanf () from /lib/libc.so.6
#2  0x080484da in main () at main.c:17
(gdb) k
Kill the program being debugged? (y or n) y
(gdb) q
]0;bxiao@pc20:~[bxiao@pc20 ~]$ gdb a.out core
[?1034hGNU gdb (GDB) Fedora 7.7.1-21.fc20
Copyright (C) 2014 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "i686-redhat-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
[New LWP 22124]
Core was generated by `a.out'.
Program terminated with signal SIGSEGV, Segmentation fault.
#0  0x479aaabe in __GI__IO_vfscanf () from /lib/libc.so.6
Missing separate debuginfos, use: debuginfo-install glibc-2.18-19.fc20.i686
(gdb) bt
#0  0x479aaabe in __GI__IO_vfscanf () from /lib/libc.so.6
#1  0x479b94a6 in __isoc99_scanf () from /lib/libc.so.6
#2  0x080484da in main () at main.c:17
(gdb) l 17
12	int main()
13	{
14	  int i;
15	
16	  printf("Enter upper bound:\n");
17	  scanf("%d", UpperBound);
18	
19	  Prime[1] = 1;
20	  Prime[2] = 1;
21	
(gdb) l main.c:17
12	int main()
13	{
14	  int i;
15	
16	  printf("Enter upper bound:\n");
17	  scanf("%d", UpperBound);
18	
19	  Prime[1] = 1;
20	  Prime[2] = 1;
21	
(gdb) l min[K[Kain
8	
9	int Prime[50],  /* Prime[i] will be 1 if i is prime, 0 otherwise */
10	UpperBound; /* check all number up through this one for primeness */
11	
12	int main()
13	{
14	  int i;
15	
16	  printf("Enter upper bound:\n");
17	  scanf("%d", UpperBound);
(gdb) gcc -g main.c prime.c
Undefined command: "gcc".  Try "help".
(gdb) q
]0;bxiao@pc20:~[bxiao@pc20 ~]$ gdb a.out core[26G[K[17Gexit[Kec /home/bxiao/a.out[17Ggcc -g main.c prime.c[K
]0;bxiao@pc20:~[bxiao@pc20 ~]$ gcc -g main.c prime.c
]0;bxiao@pc20:~[bxiao@pc20 ~]$ gdb a.out
[?1034hGNU gdb (GDB) Fedora 7.7.1-21.fc20
Copyright (C) 2014 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "i686-redhat-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) r
Starting program: /home/bxiao/a.out 
Enter upper bound:
20

Program received signal SIGSEGV, Segmentation fault.
0x08048564 in CheckPrime (K=3, Prime=0x804a080 <Prime>) at prime.c:13
13	    if (Prime[J] == 1)
Missing separate debuginfos, use: debuginfo-install glibc-2.18-19.fc20.i686
(gdb) p K[KJ
$1 = 992
(gdb) l CheckPrime
1	void CheckPrime(int K, int Prime[])
2	{
3	  int J;
4	
5	  /* the plan:  see if J divides K, for all values J which are
6	  *       (a) themselves prime (no need to try J if it is nonprime), and
7	  *       (b) less than or equal to sqrt(K) (if K has a divisor larger
8	  *               than this square root, it must also have a smaller one,
9	  *               so no need to check for larger ones) */
10	
(gdb) 
11	  J = 1;
12	  while (1)  {
13	    if (Prime[J] == 1)
14	      if (J % K == 0)  {
15	        Prime[K] = 0;
16	        return;
17	      } /* if */
18	    J++;
19	  } /* while */
20	
(gdb) k
Kill the program being debugged? (y or n) y
(gdb) r
Starting program: /home/bxiao/a.out 
Enter upper bound:
20

Program received signal SIGSEGV, Segmentation fault.
0x08048564 in CheckPrime (K=3, Prime=0x804a080 <Prime>) at prime.c:13
13	    if (Prime[J] == 1)
(gdb) b main
Breakpoint 1 at 0x80484b9: file main.c, line 16.
(gdb) r
The program being debugged has been started already.
Start it from the beginning? (y or n) y
Starting program: /home/bxiao/a.out 

Breakpoint 1, main () at main.c:16
warning: Source file is more recent than executable.
16	  printf("Enter upper bound:\n");
(gdb) n
Enter upper bound:
17	  scanf("%d", &UpperBound);
(gdb) 20
Undefined command: "20".  Try "help".
(gdb) r
The program being debugged has been started already.
Start it from the beginning? (y or n) y
Starting program: /home/bxiao/a.out 

Breakpoint 1, main () at main.c:16
16	  printf("Enter upper bound:\n");
(gdb) n
Enter upper bound:
17	  scanf("%d", &UpperBound);
(gdb) n
20
19	  Prime[1] = 1;
(gdb) p UpperBound
$2 = 20
(gdb) s
20	  Prime[2] = 1;
(gdb) s
22	  for (i = 3; i <= UpperBound; i += 2) {
(gdb) s
23	    CheckPrime(i, Prime);
(gdb) n

Program received signal SIGSEGV, Segmentation fault.
0x08048564 in CheckPrime (K=3, Prime=0x804a080 <Prime>) at prime.c:13
13	    if (Prime[J] == 1)
(gdb) s

Program terminated with signal SIGSEGV, Segmentation fault.
The program no longer exists.
(gdb) p Preim[K[K[Kime[K[K[K[K[K[K[Kr
Starting program: /home/bxiao/a.out 

Breakpoint 1, main () at main.c:16
16	  printf("Enter upper bound:\n");
(gdb) n
Enter upper bound:
17	  scanf("%d", &UpperBound);
(gdb) n
20
19	  Prime[1] = 1;
(gdb) p UpperBound
$3 = 20
(gdb) s
20	  Prime[2] = 1;
(gdb) ss
Undefined command: "ss".  Try "help".
(gdb) s
22	  for (i = 3; i <= UpperBound; i += 2) {
(gdb) s
23	    CheckPrime(i, Prime);
(gdb) n

Program received signal SIGSEGV, Segmentation fault.
0x08048564 in CheckPrime (K=3, Prime=0x804a080 <Prime>) at prime.c:13
13	    if (Prime[J] == 1)
(gdb) s[Kr
The program being debugged has been started already.
Start it from the beginning? (y or n) y
Starting program: /home/bxiao/a.out 

Breakpoint 1, main () at main.c:16
16	  printf("Enter upper bound:\n");
(gdb) n
Enter upper bound:
17	  scanf("%d", &UpperBound);
(gdb) n
20
19	  Prime[1] = 1;
(gdb) n
20	  Prime[2] = 1;
(gdb) s
22	  for (i = 3; i <= UpperBound; i += 2) {
(gdb) p Prime[3]
$4 = 0
(gdb) b CheckPrime
Breakpoint 2 at 0x804854e: file prime.c, line 11.
(gdb) k
Kill the program being debugged? (y or n) y
(gdb) r
Starting program: /home/bxiao/a.out 

Breakpoint 1, main () at main.c:16
16	  printf("Enter upper bound:\n");
(gdb) c
Continuing.
Enter upper bound:
20

Breakpoint 2, CheckPrime (K=3, Prime=0x804a080 <Prime>) at prime.c:11
11	  J = 1;
(gdb) D[Kdisp J
1: J = 0
(gdb) s
13	    if (Prime[J] == 1)
1: J = 1
(gdb) s
14	      if (J % K == 0)  {
1: J = 1
(gdb) s
18	    J++;
1: J = 1
(gdb) s
19	  } /* while */
1: J = 2
(gdb) undisp 1
(gdb) k
Kill the program being debugged? (y or n) y
(gdb) d 1
(gdb) r
Starting program: /home/bxiao/a.out 
Enter upper bound:
20

Breakpoint 2, CheckPrime (K=3, Prime=0x804a080 <Prime>) at prime.c:11
11	  J = 1;
(gdb) c
Continuing.

Program received signal SIGSEGV, Segmentation fault.
0x08048564 in CheckPrime (K=3, Prime=0x804a080 <Prime>) at prime.c:13
13	    if (Prime[J] == 1)
(gdb) P [K[Kp J
$5 = 992
(gdb) k
Kill the program being debugged? (y or n) y
(gdb) d
Delete all breakpoints? (y or n) n
(gdb) q
]0;bxiao@pc20:~[bxiao@pc20 ~]$ gdb a.out[18Gcc -g main.c prime.c
]0;bxiao@pc20:~[bxiao@pc20 ~]$ gcc -g main.c prime.c[18Gdb a.out[K
[?1034hGNU gdb (GDB) Fedora 7.7.1-21.fc20
Copyright (C) 2014 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "i686-redhat-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) k
The program is not being run.
(gdb) d
(gdb) y
Undefined command: "y".  Try "help".
(gdb) r
Starting program: /home/bxiao/a.out 
Enter upper bound:
20
3 is a prime
5 is a prime
7 is a prime
9 is a prime
11 is a prime
13 is a prime
15 is a prime
17 is a prime
19 is a prime
[Inferior 1 (process 24024) exited normally]
Missing separate debuginfos, use: debuginfo-install glibc-2.18-19.fc20.i686
(gdb) q
]0;bxiao@pc20:~[bxiao@pc20 ~]$ exit
exit

Script done on Mon 13 Apr 2015 11:06:53 PM PDT
